//+------------------------------------------------------------------+
//|                                              iPhone MetaTrader 4 |
//|                   Copyright 2000-2020, MetaQuotes Software Corp. |
//|                                        http://www.metaquotes.net |
//+------------------------------------------------------------------+
//+------------------------------------------------------------------+
//| шейдер работы с текстом                                          |
//+------------------------------------------------------------------+
precision mediump float;
//--- in параметры
varying lowp vec4 v_color;
varying vec2      v_tex;
//---
uniform sampler2D s_texture;
//--- 
void main(void)
  {
   gl_FragColor=v_color * vec4(1.0,1.0,1.0,texture2D(s_texture,v_tex).a);
  }
//+------------------------------------------------------------------+
